app/views/questions/_answer.html.erb

  <p><%= answer.body %></p>
  <% if answer.comments.count > 0 %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."answer_id" = $1  [["answer_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."answer_id" = $1  [["answer_id", 2]]