instasmart/app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."active" = $1 ORDER BY created_at DESC  [["active", "t"]]
---
  def active
    @questions = Question.all.where(active: true).order("created_at DESC")

SELECT "questions".* FROM "questions" WHERE "questions"."active" = $1 ORDER BY cached_votes_total DESC  [["active", "t"]]
---
  def popular
    @questions = Question.all.where(active: true).order("cached_votes_total DESC")

SELECT "questions".* FROM "questions" WHERE "questions"."active" = $1  [["active", "f"]]
---
  def inactive
    @questions = Question.all.where(active: false)

INSERT INTO "questions" ("user_id", "body", "active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["body", "But Joan has a question too!"], ["active", "t"], ["created_at", "2017-06-10 18:50:04.819820"], ["updated_at", "2017-06-10 18:50:04.819820"]]
---
  def create
    @question = Question.new(question_params)
    @question.save

UPDATE "questions" SET "user_id" = $1, "body" = $2, "updated_at" = $3 WHERE "questions"."id" = $4  [["user_id", 2], ["body", "Why can't I delete a question now?"], ["updated_at", "2017-06-11 20:30:14.765057"], ["id", 9]]
---
  def update
    @question.update(question_params)

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def like
    @question.liked_by User.first

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def unlike
    @question.unliked_by User.first