instasmart/app/views/questions/_form.html.erb

SELECT "users".* FROM "users" ORDER BY "users"."first_name" ASC
---
  <%= f.label :user %><br />
  <%= f.collection_select :user_id, User.order(:first_name), :id, :full_name,  include_blank: true %>