instasmart/app/views/questions/show.html.erb

<h4>  Tags:
<% @question.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."question_id" = $1  [["question_id", 7]]


<% if @question.answers.count > 0 %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 1]]
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 3]]