app/views/tags/index.html.erb

    <td><%= link_to tag.name, tag_path(tag) %></td>
    <td><%= tag.questions.count %></td>
---
SELECT COUNT(*) FROM "questions" INNER JOIN "taggings" ON "questions"."id" = "taggings"."question_id" WHERE "taggings"."tag_id" = $1  [["tag_id", 1]]