app/views/tags/show.html.erb

<ul>
  <% @tag.questions.each do |question| %>
---
SELECT "questions".* FROM "questions" INNER JOIN "taggings" ON "questions"."id" = "taggings"."question_id" WHERE "taggings"."tag_id" = $1  [["tag_id", 5]]