app/controllers/answers_controller.rb

INSERT INTO "answers" ("question_id", "user_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["question_id", 4], ["user_id", 1], ["body", "Just add them to the tag_list field."], ["created_at", "2017-06-12 03:20:44.800270"], ["updated_at", "2017-06-12 03:20:44.800270"]]
---
  def create
    @answer = Answer.new(answer_params)
    @answer.question_id = params[:question_id]
    @answer.user = current_user
    @answer.save

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def set_answer
      @answer = Answer.find(params[:id])
      @question = Question.find(@answer.question_id)