app/controllers/users_controller.rb

	def index
		@users = User.all
---
SELECT "users".* FROM "users" ORDER BY first_name ASC